FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_eic.h
/**
 * \file
 *
 * \brief Component description for EIC
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMD20_EIC_COMPONENT_
#define _SAMD20_EIC_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR EIC */
/* ========================================================================== */
/** \addtogroup SAMD20_EIC External Interrupt Controller */
/*@{*/

#define REV_EIC    0x101

/* -------- EIC_CTRL : (EIC Offset: 0x00) (R/W  8) Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t SWRST : 1;  /*!< bit:      0  Software Reset                     */
            uint8_t ENABLE : 1; /*!< bit:      1  Enable                             */
            uint8_t  : 6;       /*!< bit:  2.. 7  Reserved                           */
        } bit;                  /*!< Structure used for bit  access                  */
        uint8_t reg;            /*!< Type      used for register access              */
    } EIC_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_CTRL_OFFSET        0x00              /**< \brief (EIC_CTRL offset) Control Register */
#define EIC_CTRL_RESETVALUE    0x00              /**< \brief (EIC_CTRL reset_value) Control Register */

#define EIC_CTRL_SWRST_Pos     0                 /**< \brief (EIC_CTRL) Software Reset */
#define EIC_CTRL_SWRST         ( 0x1u << EIC_CTRL_SWRST_Pos )
#define EIC_CTRL_ENABLE_Pos    1                 /**< \brief (EIC_CTRL) Enable */
#define EIC_CTRL_ENABLE        ( 0x1u << EIC_CTRL_ENABLE_Pos )
#define EIC_CTRL_MASK          0x03u             /**< \brief (EIC_CTRL) MASK Register */

/* -------- EIC_STATUS : (EIC Offset: 0x01) (R/   8) Status Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t  : 7;         /*!< bit:  0.. 6  Reserved                           */
            uint8_t SYNCBUSY : 1; /*!< bit:      7  Sync Busy                          */
        } bit;                    /*!< Structure used for bit  access                  */
        uint8_t reg;              /*!< Type      used for register access              */
    } EIC_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_STATUS_OFFSET          0x01          /**< \brief (EIC_STATUS offset) Status Register */
#define EIC_STATUS_RESETVALUE      0x00          /**< \brief (EIC_STATUS reset_value) Status Register */

#define EIC_STATUS_SYNCBUSY_Pos    7             /**< \brief (EIC_STATUS) Sync Busy */
#define EIC_STATUS_SYNCBUSY        ( 0x1u << EIC_STATUS_SYNCBUSY_Pos )
#define EIC_STATUS_MASK            0x80u         /**< \brief (EIC_STATUS) MASK Register */

/* -------- EIC_NMICTRL : (EIC Offset: 0x02) (R/W  8) NMI Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t NMISENSE : 3;  /*!< bit:  0.. 2  NMI Input Sense Configuration      */
            uint8_t NMIFILTEN : 1; /*!< bit:      3  NMI Filter Enable                  */
            uint8_t  : 4;          /*!< bit:  4.. 7  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint8_t reg;               /*!< Type      used for register access              */
    } EIC_NMICTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_NMICTRL_OFFSET             0x02      /**< \brief (EIC_NMICTRL offset) NMI Control Register */
#define EIC_NMICTRL_RESETVALUE         0x00      /**< \brief (EIC_NMICTRL reset_value) NMI Control Register */

#define EIC_NMICTRL_NMISENSE_Pos       0         /**< \brief (EIC_NMICTRL) NMI Input Sense Configuration */
#define EIC_NMICTRL_NMISENSE_Msk       ( 0x7u << EIC_NMICTRL_NMISENSE_Pos )
#define EIC_NMICTRL_NMISENSE( value )    ( ( EIC_NMICTRL_NMISENSE_Msk & ( ( value ) << EIC_NMICTRL_NMISENSE_Pos ) ) )
#define   EIC_NMICTRL_NMISENSE_NONE    ( 0x0u << 0 ) /**< \brief (EIC_NMICTRL) No detection */
#define   EIC_NMICTRL_NMISENSE_RISE    ( 0x1u << 0 ) /**< \brief (EIC_NMICTRL) Rising edge detection */
#define   EIC_NMICTRL_NMISENSE_FALL    ( 0x2u << 0 ) /**< \brief (EIC_NMICTRL) Falling edge detection */
#define   EIC_NMICTRL_NMISENSE_BOTH    ( 0x3u << 0 ) /**< \brief (EIC_NMICTRL) Both edges detection */
#define   EIC_NMICTRL_NMISENSE_HIGH    ( 0x4u << 0 ) /**< \brief (EIC_NMICTRL) High level detection */
#define   EIC_NMICTRL_NMISENSE_LOW     ( 0x5u << 0 ) /**< \brief (EIC_NMICTRL) Low level detection */
#define EIC_NMICTRL_NMIFILTEN_Pos      3             /**< \brief (EIC_NMICTRL) NMI Filter Enable */
#define EIC_NMICTRL_NMIFILTEN          ( 0x1u << EIC_NMICTRL_NMIFILTEN_Pos )
#define EIC_NMICTRL_MASK               0x0Fu         /**< \brief (EIC_NMICTRL) MASK Register */

