FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_eic.h
/* -------- EIC_NMIFLAG : (EIC Offset: 0x03) (R/W  8) NMI Interrupt Flag Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t NMI : 1;   /*!< bit:      0  NMI Interrupt Flag                 */
            uint8_t  : 7;      /*!< bit:  1.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } EIC_NMIFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_NMIFLAG_OFFSET        0x03           /**< \brief (EIC_NMIFLAG offset) NMI Interrupt Flag Register */
#define EIC_NMIFLAG_RESETVALUE    0x00           /**< \brief (EIC_NMIFLAG reset_value) NMI Interrupt Flag Register */

#define EIC_NMIFLAG_NMI_Pos       0              /**< \brief (EIC_NMIFLAG) NMI Interrupt Flag */
#define EIC_NMIFLAG_NMI           ( 0x1u << EIC_NMIFLAG_NMI_Pos )
#define EIC_NMIFLAG_MASK          0x01u          /**< \brief (EIC_NMIFLAG) MASK Register */

/* -------- EIC_EVCTRL : (EIC Offset: 0x04) (R/W 32) Event Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t EXTINTEO : 32; /*!< bit:  0..31  External Interrupt Event Output Enable */
        } bit;                      /*!< Structure used for bit  access                  */
        uint32_t reg;               /*!< Type      used for register access              */
    } EIC_EVCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_EVCTRL_OFFSET          0x04          /**< \brief (EIC_EVCTRL offset) Event Control Register */
#define EIC_EVCTRL_RESETVALUE      0x00000000    /**< \brief (EIC_EVCTRL reset_value) Event Control Register */

#define EIC_EVCTRL_EXTINTEO_Pos    0             /**< \brief (EIC_EVCTRL) External Interrupt Event Output Enable */
#define EIC_EVCTRL_EXTINTEO_Msk    ( 0xFFFFFFFFu << EIC_EVCTRL_EXTINTEO_Pos )
#define EIC_EVCTRL_EXTINTEO( value )    ( ( EIC_EVCTRL_EXTINTEO_Msk & ( ( value ) << EIC_EVCTRL_EXTINTEO_Pos ) ) )
#define EIC_EVCTRL_MASK            0xFFFFFFFFu   /**< \brief (EIC_EVCTRL) MASK Register */

/* -------- EIC_INTENCLR : (EIC Offset: 0x08) (R/W 32) Interrupt Enable Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t EXTINT : 16; /*!< bit:  0..15  External Interrupt Disable         */
            uint32_t : 16;        /*!< bit: 16..31  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } EIC_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_INTENCLR_OFFSET        0x08          /**< \brief (EIC_INTENCLR offset) Interrupt Enable Clear Register */
#define EIC_INTENCLR_RESETVALUE    0x00000000    /**< \brief (EIC_INTENCLR reset_value) Interrupt Enable Clear Register */

#define EIC_INTENCLR_EXTINT_Pos    0             /**< \brief (EIC_INTENCLR) External Interrupt Disable */
#define EIC_INTENCLR_EXTINT_Msk    ( 0xFFFFu << EIC_INTENCLR_EXTINT_Pos )
#define EIC_INTENCLR_EXTINT( value )    ( ( EIC_INTENCLR_EXTINT_Msk & ( ( value ) << EIC_INTENCLR_EXTINT_Pos ) ) )
#define EIC_INTENCLR_MASK          0x0000FFFFu   /**< \brief (EIC_INTENCLR) MASK Register */

/* -------- EIC_INTENSET : (EIC Offset: 0x0C) (R/W 32) Interrupt Enable Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t EXTINT : 16; /*!< bit:  0..15  External Interrupt Disable         */
            uint32_t : 16;        /*!< bit: 16..31  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } EIC_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_INTENSET_OFFSET        0x0C          /**< \brief (EIC_INTENSET offset) Interrupt Enable Set Register */
#define EIC_INTENSET_RESETVALUE    0x00000000    /**< \brief (EIC_INTENSET reset_value) Interrupt Enable Set Register */

#define EIC_INTENSET_EXTINT_Pos    0             /**< \brief (EIC_INTENSET) External Interrupt Disable */
#define EIC_INTENSET_EXTINT_Msk    ( 0xFFFFu << EIC_INTENSET_EXTINT_Pos )
#define EIC_INTENSET_EXTINT( value )    ( ( EIC_INTENSET_EXTINT_Msk & ( ( value ) << EIC_INTENSET_EXTINT_Pos ) ) )
#define EIC_INTENSET_MASK          0x0000FFFFu   /**< \brief (EIC_INTENSET) MASK Register */

/* -------- EIC_INTFLAG : (EIC Offset: 0x10) (R/W 32) Interrupt Flag Status and Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t EXTINT : 16; /*!< bit:  0..15  External Interrupt Flag            */
            uint32_t : 16;        /*!< bit: 16..31  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } EIC_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EIC_INTFLAG_OFFSET        0x10           /**< \brief (EIC_INTFLAG offset) Interrupt Flag Status and Clear Register */
#define EIC_INTFLAG_RESETVALUE    0x00000000     /**< \brief (EIC_INTFLAG reset_value) Interrupt Flag Status and Clear Register */

#define EIC_INTFLAG_EXTINT_Pos    0              /**< \brief (EIC_INTFLAG) External Interrupt Flag */
#define EIC_INTFLAG_EXTINT_Msk    ( 0xFFFFu << EIC_INTFLAG_EXTINT_Pos )
#define EIC_INTFLAG_EXTINT( value )    ( ( EIC_INTFLAG_EXTINT_Msk & ( ( value ) << EIC_INTFLAG_EXTINT_Pos ) ) )
#define EIC_INTFLAG_MASK          0x0000FFFFu    /**< \brief (EIC_INTFLAG) MASK Register */

